Repository: sheilagomes/wp-trad
Catalog: tm/PHP_en-pt_BR.tmx
Source language: en
Languages: pt_br

source: This information is intended for "debugging server" that can run inside an IDE or programmable editor (such as Emacs).
pt_br: Estas informações são destinadas a "debugar o servidor" de dentro de um sistema IDE ou editor de arquivos programável (como o Emacs).

source: How to set up the debugger:
pt_br: Como ativar o debugger:

source: Set up a TCP port for the debugger in the configuration file (debugger.port) and enable it (debugger.enabled).
pt_br: Configure uma porta TCP para ele no arquivo de configuração (debugger.port) e habilite ele (debugger.enabled).

source: Set up a TCP listener on that port somewhere (for example socket -l -s 1400 on UNIX).
pt_br: Configure um "ouvidor" TCP naquela porta em algum programa (por exemplo socket -l -s 1400 no UNIX).

source: In your code, run "debugger_on (host)", where host is the IP number or name of the host running the TCP listener.
pt_br: Em seu código execute um "debugger_on (endereço )", onde endereço é o número IP ou nome do computador executando o "ouvidor" TCP.

source: Example 52-1.
pt_br: Exemplo 52-1.

source: Frequently Asked Questions
pt_br: Perguntas Mais FreqÃ¼entes

source: Stream open options
pt_br: Próxima

source: Example 51-1.
pt_br: Exemplo 51-1.

source: Example 51-2.
pt_br: Exemplo 51-2.

source: Example 51-3.
pt_br: Exemplo 51-3.

source: As of version 4.3.0, PHP supports a new SAPI type (Server Application Programming Interface) named CLI which means Command Line Interface.
pt_br: Capítulo 23.

source: As the name implies, this SAPI type main focus is on developing shell (or desktop as well) applications with PHP.
pt_br: Utilizando o PHP na linha de comando

source: It' s worth mentioning that CLI and CGI are different SAPI's although they do share many of the same behaviors.
pt_br: A partir versão 4.3, o PHP suporta um novo tipo SAPI (Server Application Programming Interface) chamado CLI que significa Command Line Interface.

source: Since PHP 4.3.0 the CLI SAPI is no longer experimental and the option --enable-cli is on by default.
pt_br: Como o próprio nome indica, essa SAPI tem foco no desenvolvimento de aplicações shell (ou no terminal / linha de comando) com o PHP.

source: As of PHP 4.3.0, the name, location and existence of the CLI / CGI binaries will differ depending on how PHP is installed on your system.
pt_br: As diferenças entre a CLI SAPI e as outras SAPI s são detalhadas neste capítulo.

source: You will note that both are named php.
pt_br: A CLI SAPI foi liberada primeiramente com o PHP 4.2.0, mas ainda em estágio experimental, sendo necessário ativá-la explicitamente com a opção --enable-cli durante o. / configure.

source: If a module SAPI is chosen during configure, such as apxs, or the --disable-cgi option is used, the CLI is copied to {PREFIX} / bin / php during make install otherwise the CGI is placed there.
pt_br: Desde o PHP 4.0.3 a CLI SAPI não mais é experimental e é sempre compilada e instalada como o arquivo php (chamado php.exe no Windows), no formato binário executável.

source: So, for example, if --with--apxs is in your configure line then the CLI is copied to {PREFIX} / bin / php during make install.
pt_br: Diferenças importantes das CLI SAPI comparada com outras SAPI s:

source: Alternatively you can specify --disable-cgi in your configure line.
pt_br: Diferentemente da CGI SAPI, nenhum header é impresso na saída.

source: Because both --enable-cli and --enable-cgi are enabled by default, simply having --enable-cli in your configure line does not necessarily mean the CLI will be copied as {PREFIX} / bin / php during make install.
pt_br: A CGI SAPI possui um meio de suprimir os headers HTTP, mas não há uma chave equivalente para ativá-los na CLI SAPI.

source: What SAPI do I have?:
pt_br: A versão CLI é definida silenciosa por padrão.

source: See also the function php_sapi_name() and the constant PHP_SAPI.
pt_br: Mas a chave -q é mantida para compatibilidade, de forma que você possa utilizar scripts CGI antigos.

source: Unlike the CGI SAPI, no headers are written to the output.
pt_br: Ela não altera o diretório de execução para o do script. (a chave -C também é mantida para compatibilidade).

source: Though the CGI SAPI provides a way to suppress HTTP headers, there 's no equivalent switch to enable them in the CLI SAPI.
pt_br: Mensagens de erro em texto simples (sem formatação HTML).

source: It does not change the working directory to that of the script. (-C switch kept for compatibility)
pt_br: Estas são as diretivas do php.ini que são sobrescritas pela CLI SAPI porque não fazem sentido no ambiente shell:

source: Plain text error messages (no HTML formatting).
pt_br: Tabela 23-1.

source: There are certain php.ini directives which are overriden by the CLI SAPI because they do not make sense in shell environments:
pt_br: Diretivas php.ini sobrescritas

source: Table 23-1.
pt_br: Diretiva

source: Overriden php.ini directives
pt_br: Valor default CLI SAPI

source: Directive
pt_br: Comentários

source: It can be quite hard to read the error message in your shell when it 's cluttered with all those meaningless HTML tags, therefore this directive defaults to FALSE.
pt_br: Pode ser bem difícil de ler mensagens de erro no seu shell quando elas estão embebidas dentro de tags HTML, por isso essa diretiva tem default para FALSE.

source: It is desired that any output coming from print(), echo() and friends is immediately written to the output and not cached in any buffer.
pt_br: Essa diretiva causa que qualquer saída gerada de um print(), echo() e semelhantes sejam imediatamente escritas para o output e não cacheadas em nenhum buffer.

source: You still can use output buffering if you want to defer or manipulate standard output.
pt_br: Você ainda pode usar o output buffering se você precisa atrasar ou manipular a saída padrão.

source: Due to endless possibilities of using PHP in shell environments, the maximum execution time has been set to unlimited.
pt_br: Devido as infinitas possibilidades da utilização do PHP em ambientes shell, tempo máximo de execução foi configurado para ilimitado.

source: Whereas applications written for the web are often executed very quickly, shell application tend to have a much longer execution time.
pt_br: Enquanto aplicações escritas para web são geralmente executadas em poucos segundos, aplicações no shell tendem a ter um tempo de execução mais longo.

source: As of PHP 4.3.0, the PHP variables $argc and $argv are registered and filled in with the appropriate values when using the CLI SAPI.
pt_br: Nota:

source: Prior to this version, the creation of these variables behaved as they do in CGI and MODULE versions which requires the PHP directive register_globals to be on.
pt_br: Estas diretivas não podem ser inicializadas com outros valores do arquivo de configuração php.ini ou um arquivo personalizado (se informado).

source: Example: $_SERVER[ 'argv']
pt_br: Esta limitação existe porque estes valores são aplicados depois que todos os arquivos de configuração são analisados.

source: These directives cannot be initialized with another value from the configuration file php.ini or a custom one (if specified).
pt_br: Entretanto, seus valores podem ser modificados durante a execução (o que pode não fazer sentido para todas elas, por exemplo, register_argc_argv).

source: However, their value can be changed during runtime (which does not make sense for all of those directives, e.g. register_argc_argv).
pt_br: Para facilicar a operação no ambiente shell, as seguintes constantes estão definidas:

source: To ease working in the shell environment, the following constants are defined:
pt_br: Tabela 23-2.

source: CLI specific Constants
pt_br: Constantes específicas CLI

source: Given the above, you don 't need to open e.g. a stream for stderr yourself but simply use the constant instead of the stream resource:
pt_br: Considerando isso, você não precisará mais abrí-los, por exemplo o stderr você mesmo, mas simplesmente usar a constante em vez do recurso stream:

source: The CLI SAPI does not change the current directory to the directory of the executed script!
pt_br: A CLI SAPI não modifica o diretório de execução atual para o diretório onde o script é interpretado!

source: Example showing the difference to the CGI SAPI:
pt_br: Exemplo mostrando a diferença da CGI SAPI:

# ?php / * Our simple test application named test.php* / echo getcwd(), " ";?
source: ?php / * Our simple test application named test.php* / echo getcwd(), "\n";?
pt_br: ?php / * Nossa aplicação de teste * / echo getcwd(), "\n";?

source: When using the CGI version, the output is:
pt_br: Quando utilizando a versão CGI, a saída é

source: $pwd / tmp $php -q another_directory / test.php / tmp / another_directory
pt_br: $pwd / tmp $php-cgi -f outro_diretorio / test.php / tmp / outro_diretorio

source: Using the CLI SAPI yields:
pt_br: Utilizando a versão CLI SAPI:

source: $pwd / tmp $php -f another_directory / test.php / tmp
pt_br: $pwd / tmp $php -f outro_diretorio / test.php / tmp

source: The CGI SAPI supports the CLI SAPI behaviour by means of the -C switch when run from the command line.
pt_br: A CGI SAPI suporta o comportamento da CLI SAPI utilizando a chave -C quando de sua execução na linha de comando.

source: The list of command line options provided by the PHP binary can be queried anytime by running PHP with the -h switch:
pt_br: A lista de opções de linha de comando fornecidas pelo binário do PHP pode ser solicitada a qualquer tempo executando o PHP com a opção -h:

source: The CLI SAPI has three different ways of getting the PHP code you want to execute:
pt_br: A CLI SAPI fornecer três maneiras diferentes para você executar seu código PHP:

source: Telling PHP to execute a certain file.
pt_br: Chamando o PHP para executar um arquivo determinado.

source: Pass the PHP code to execute directly on the command line.
pt_br: Passar o código PHP para execução diretamente a linha de comando.

source: Read the example carefully, there are no beginning or ending tags!
pt_br: Leia o exemplo cuidadosamente, observando que não há tags de abertura ou fechamento!

source: The -r switch simply does not need them.
pt_br: A opção -r simplesmente não precisa delas.

source: Using them will lead to a parser error.
pt_br: Utilizando-as você obterá erros de interpretação.

source: Provide the PHP code to execute via standard input (stdin).
pt_br: Fornece código PHP para interpretação via a entrada padrão (stdin).

source: This gives the powerful ability to dynamically create PHP code and feed it to the binary, as shown in this (fictional) example:
pt_br: Isto mostra a habilidade poderosa de como criar dinamicamente código PHP e fornecê-lo ao binário, como demonstrado neste exemplo (apenas demonstrativo):

source: $some_application _BAR_ some_filter _BAR_ php _BAR_ sort -u final_output.txt
pt_br: $alguma_aplicacao _BAR_ algum_filtro _BAR_ php _BAR_ sort -u final_output.txt

source: Like every shell application, the PHP binary accepts a number of arguments but your PHP script can also receive arguments.
pt_br: Assim como qualquer aplicação shell, não somente o binário do PHP aceita um certo número de argumentos, mas também seu script PHP também pode recebê-los.

source: The number of arguments which can be passed to your script is not limited by PHP (the shell has a certain size limit in the number of characters which can be passed; usually you won't hit this limit).
pt_br: O número de argumentos que podem ser passados para seu script não é limitado ao PHP (mas o shell tem um certo limite de tamanho em caracteres que podem ser informados, e não há um padrão para esse limite).

source: The arguments passed to your script are available in the global array $argv.
pt_br: Os argumentos passados para seu script são disponibilizados no array global $argv.

source: The zero index always contains the script name (which is - in case the PHP code is coming from either standard input or from the command line switch -r).
pt_br: No índice zero sempre conterá o nome do script (podendo ser - no caso de código PHP estar vindo da entrada padrão ou da opção de linha de comando -r).

source: The second registered global variable is $argc which contains the number of elements in the $argv array (not the number of arguments passed to the script).
pt_br: O segunda variável global $argc contém o número de elementos no array $argv (mas não o número de argumentos passados para seu script.

source: As long as the arguments you want to pass to your script do not start with the - character, there 's nothing special to watch out for.
pt_br: Os argumentos que você deseja passar para seu script não podem começar com o caracter - e isso não pode ser modificado.

source: Passing an argument to your script which starts with a - will cause trouble because PHP Passing an argument to your script which starts with a - will cause trouble because PHP itself thinks it has to handle it.
pt_br: Passando argumentos para seu script que comecem com um - causará problemas porque o PHP tentará manuseá-los.

source: To prevent this, use the argument list separator - -.
pt_br: Para prevenir isso, utilize o separador de argumentos - -.

source: After this separator has been parsed by PHP, every argument following it is passed untouched to your script.
pt_br: Depois que os argumentos são interpretados pelo PHP, todos os argumentos restantes são repassados intocados para seu script.

source: # This will not execute the given code but will show the PHP usage $php -r 'var_dump($argv);' -h Usage: php [options] [-f] file [args...] [...] # This will pass the '-h 'argument to your script and prevent PHP from showing it's usage $php -r'var_dump($argv);' - - -h array(2) {[0]= string(1) "-" [1]= string(2) "-h "}
pt_br: # Isto não executará o código fornecido e irá fazer o PHP mostrar sua ajuda $php -r 'var_dump($argv);' -h Usage: php [options] [-f] file [args...] [...] # Isto passará o argumento '-h 'para seu script e prevenirá o PHP de usá-lo $php -r 'var_dump($argv);' - - -h array(2) {[0]= string(1) "-" [1]= string(2) "-h "}

source: However, there 's another way of using PHP for shell scripting.
pt_br: Entretanto, há ainda uma outra maneira de se utilizar o PHP no shell.

source: Following this you can place normal PHP code included within the PHP starting and end tags.
pt_br: Você pode escrever um script que na primeira linha tenha #! / usr / bin / php e na seqüência tenha código PHP normal, incluindo as tags de início e fim e os atributos de execução do arquivo.

source: Once you have set the execution attributes of the file appropriately (e.g. chmod +x test) your script can be executed like a normal shell or perl script:
pt_br: Desta maneira ele pode ser executado como um script shell ou PERL normalmente:

source: $chmod 755 test $. / test -h - - foo array( 4) {[0]= string(6) ". / test" [1]= string(2) "-h "[2]= string(2) "- -" [3]= string(3) "foo "}
pt_br: $chmod 755 teste $. / test -h - - foo array( 4) {[0]= string(6) ". / teste" [1]= string(2) "-h "[2]= string(2) "- -" [3]= string(3) "foo "}

source: Table 23-3.
pt_br: Tabela 23-3.

source: Command line options
pt_br: Opções de linha de comando

source: Option
pt_br: Opção

source: Description
pt_br: Descrição

source: Display colour syntax highlighted source.
pt_br: Mostra o código fonte com destaque de cores.

source: This option uses the internal mechanism to parse the file and produces a HTML highlighted version of it and writes it to standard output.
pt_br: Esta opção usa o mecanismo interno para interpretar o arquivo e produzir uma versão HTML do fonte com destaque de cores e a envia para a saída padrão.

source: Note that all it does it to generate a block of code [...] / code HTML tags, no HTML headers.
pt_br: Note que ele somente gerará blocos de code [...] / code, mas não headers HTML.

source: This option does not work together with the -r option.
pt_br: Esta opção não funciona juntamente com a opção -r.

source: Display source with stripped comments and whitespace.
pt_br: Mostra o fonte sem comentários e espaços em branco.

source: This switch is optional and can be left out.
pt_br: Interpreta e executa o arquivo informado com a opção -f Esta diretiva é opcional e pode ser deixada de lado.

source: Only providing the filename to execute is sufficient.
pt_br: Informar somente o nome do arquivo para execução é suficiente.

source: Writes the PHP, PHP SAPI, and Zend version to standard output, e.g.
pt_br: Imprime as versões o PHP, PHP SAPI e Zend para a saída padrão, por exemplo:

source: $php -v PHP 4.3.0 (cli), Copyright (c) 1997-2002 The PHP Group Zend Engine v1.3.0, Copyright (c) 1998-2002 Zend Technologies
pt_br: $php -v PHP 4.3.0-dev (cli), Copyright (c) 1997-2002 The PHP Group Zend Engine v1.2.1, Copyright (c) 1998-2002 Zend Technologies

source: With this option one can either specify a directory where to look for php.ini or you can specify a custom INI file directly (which does not need to be named php.ini), e.g.:
pt_br: Esta opção informa um diretório onde procurar pelo php.ini ou especifica um arquivo INI personalizado diretamente (não presisa ser obrigatoriamente php.ini), por exemplo:

source: Runs PHP interactively.
pt_br: Executa o PHP no modo interativo.

source: This option allows you to set a custom value for any of the configuration directives allowed in php.ini.
pt_br: Esta opção permite definir um valor personalizado para qualquer diretiva de configuração permitida no php.ini.

source: The syntax is:
pt_br: Sintaxe:

source: -d configuration_directive[ =value]
pt_br: -d diretiva[ =valor]

source: # Omitting the value part will set the given configuration directive to "1" $php -d max_execution_time -r '$foo = ini_get("max_execution_time"); var_dump($foo); 'string(1) "1 "# Passing an empty value part will set the configuration directive to" "php -d max_execution_time= -r '$foo = ini_get("max_execution_time"); var_dump($foo);' string(0)" "# The configuration directive will be set to anything passed after the '= 'character $php -d max_execution_time=20 -r '$foo = ini_get("max_execution_time"); var_dump($foo);' string(2) "20" $php -d max_execution_time=doesntmakesense -r '$foo = ini_get("max_execution_time"); var_dump($foo); 'string(15) "doesntmakesense "
pt_br: # Omitindo a parte do valor irá configurar a diretiva para "1" $php -d max_execution_time -r '$foo = ini_get("max_execution_time"); var_dump($foo); 'string(1) "1 "# Passando um valor vazio irá configurar a diretiva para" "php -d max_execution_time= -r '$foo = ini_get("max_execution_time"); var_dump($foo);' string(0)" "# A diretiva de configuração será preenchida com qualquer coisa informada depois do caracter =' '$php -d max_execution_time=20 -r '$foo = ini_get("max_execution_time"); var_dump($foo);' string(2) "20" $php -d max_execution_time=instonaofazsentido -r '$foo = ini_get("max_execution_time"); var_dump($foo); 'string(15) "instonaofazsentido "

source: Generate extended information for debugger / profiler.
pt_br: Gera informações estendidas para o debugador / profiler.

source: Load Zend extension.
pt_br: Carrega a extensão Zend.

source: If only a filename is given, PHP tries to load this extension from the current default library path on your system (usually specified / etc / ld.so.conf on Linux systems).
pt_br: Se somente o nome de arquivo é fornecido, o PHP tenta carregar essa extensão do caminho default de bibliotecas do seu sistema (geralmente especificado em / etc / ld.so.conf em sistemas Linux).

source: Passing a filename with an absolute path information will not use the systems library search path.
pt_br: Passando um nome de arquivo com o caminho absoluto irá evitar a procura no caminho das bibliotecas de sistema.

source: A relative filename with a directory information will tell PHP only to try to load the extension relative to the current directory.
pt_br: Um nome de arquivo com uma informação de diretório relativa fará com que o PHP apenas tente carregar a extensão no caminho relativo ao diretório atual.

source: This option provides a convenient way to only perform a syntax check on the given PHP code.
pt_br: Esta opção fornece uma maneira conveniente apenas realizar uma checagem de sintaxe no código PHP fornecido.

source: On succes, the text No syntax errors detected in filename is written to standard output and the shell return code is 0.
pt_br: No sucesso, o texto No syntax errors detected in arquivo é impresso na saída padrão e informado o código de saida de sistema 0.

source: On failure, the text Errors parsing filename in addition to the internal parser error message is written to standard output and the shell return code is set to 255.
pt_br: Em caso de erro, o texto Errors parsing filename juntamente com o a mensagem do interpretador interno é impressa para a saída padrão e o código de saída de sistema é 255.

source: This option won' t find fatal errors (like undefined functions).
pt_br: Esta opção não procura por erros fatais (como funções não definidas).

source: Use -f if you would like to test for fatal errors too.
pt_br: Use -f se você deseja detectar erros fatais também.

source: Using this option, PHP prints out the built in (and loaded) PHP and Zend modules:
pt_br: Utilizando essa opção, o PHP imprime os módulos PHP e Zend compilados (e carregados):

source: This command line option calls phpinfo(), and prints out the results.
pt_br: Esta opção de linha de comando chama a função phpinfo() e imprime seus resultados.

source: If PHP is not working correctly, it is advisable to use php -i and see whether any error messages are printed out before or in place of the information tables.
pt_br: Se o PHP não está funcionando bem, é interessante fazer um php -i Se o PHP não está funcionando bem, é interessante fazer um php -i para observar qualquer mensagem de erro impressa antes ou dentro das tabelas de informação.

source: Beware that the output is in HTML and therefore quite huge.
pt_br: Como a saída é em HTML, ela é um pouco grande.

source: This option allows execution of PHP right from within the command line.
pt_br: Esta opção permite a execução de código PHP direto da linha de comando.

source: The PHP start and end tags (?php and?) are not needed and will cause a parser error if present.
pt_br: As tags de início e fim do PHP (?php e?) não são necessárias e causarão erros de interpretação.

source: Care has to be taken when using this form of PHP to not collide with command line variable substitution done by the shell.
pt_br: Cuidados deverão ser tomados utilizando dessa forma para evitar que haja substituição de variáveis pelo shell.

source: Example showing a parser error
pt_br: Exemplo mostrando um erro de interpretação

source: With this option, you can get information about the actual list of command line options and some one line descriptions about what they do.
pt_br: Com essa opção, você pode obter informações sobre a lista atual de opções de linha de comando pequenas descrições sobre o que elas fazem.

source: The PHP executable can be used to run PHP scripts absolutely independent from the web server.
pt_br: O PHP executável pode ser utilizando para rodar scripts PHP absolutamente independente de um servidor web.

source: If you are on a Unix system, you should add a special first line to your PHP script, and make it executable, so the system will know, what program should run the script.
pt_br: Se você está num sistema Unix, você pode acrescentar uma linha especial na primeira linha de seu script e torná-lo executável, então o sistema operacional saberá que programa deverá rodar o script.
